{
  "data": [
    {
      "sentence": "A purple pig and a green donkey flew a kite in the middle of the night and ended up sunburnt."
    },
    {
      "sentence": "Last Friday I saw a spotted striped blue worm shake hands with a legless lizard."
    },
    {
      "sentence": "Sometimes it is better to just walk away from things and go back to them later when you’re in a better frame of mind."
    },
    {
      "sentence": "Writing a list of random sentences is harder than I initially thought it would be."
    },
    {
      "sentence": "If you like tuna and tomato sauce, try combining the two, it’s really not as bad as it sounds."
    },
    {
      "sentence": "Someone I know recently combined Maple Syrup & buttered Popcorn thinking it would taste like caramel popcorn. It didn’t and they don’t recommend anyone else do it either."
    },
    {
      "sentence": "Sometimes, all you need to do is completely make an ass of yourself and laugh it off to realise that life isn’t so bad after all."
    },
    {
      "sentence": "When I was little I had a car door slammed shut on my hand and I still remember it quite vividly."
    },
    {
      "sentence": "The clock within this blog and the clock on my laptop are 1 hour different from each other."
    },
    {
      "sentence": "I was very proud of my nickname throughout high school but today- I couldn’t be any different to what my nickname was."
    },
    {
      "sentence": "This is the last random sentence I will be writing and I am going to stop mid-sent"
    },
    {
      "sentence": "There were white out conditions in the town; subsequently, the roads were impassable."
    },
    {
      "sentence": "She works two jobs to make ends meet; at least, that was her reason for not having time to join us."
    },
    {
      "sentence": "Italy is my favorite country; in fact, I plan to spend two weeks there next year."
    },
    {
      "sentence": "He turned in the research paper on Friday; otherwise, he would have not passed the class."
    },
    {
      "sentence": "There was no ice cream in the freezer, nor did they have money to go to the store."
    },
    {
      "sentence": "Sometimes I stare at a door or a wall and I wonder what is this reality, why am I alive, and what is this all about?"
    },
    {
      "sentence": "Had he known what was going to happen, he would have never stepped into the shower."
    },
    {
      "sentence": "He went back to the video to see what had been recorded and was shocked at what he saw."
    },
    {
      "sentence": "She could hear him in the shower singing with a joy she hoped he'd retain after she delivered the news."
    },
    {
      "sentence": "There's an art to getting your way, and spitting olive pits across the table isn't it."
    },
    {
      "sentence": "They say that dogs are man's best friend, but this cat was setting out to sabotage that theory."
    },
    {
      "sentence": "She can live her life however she wants as long as she listens to what I have to say."
    },
    {
      "sentence": "She felt that chill that makes the hairs on the back of your neck when he walked into the room."
    },
    {
      "sentence": "He fumbled in the darkness looking for the light switch, but when he finally found it there was someone already there."
    },
    {
      "sentence": "He learned the important lesson that a picnic at the beach on a windy day is a bad idea."
    },
    {
      "sentence": "It was a slippery slope and he was willing to slide all the way to the deepest depths."
    },
    {
      "sentence": "He would only survive if he kept the fire going and he could hear thunder in the distance."
    },
    {
      "sentence": "The rusty nail stood erect, angled at a 45-degree angle, just waiting for the perfect barefoot to come along."
    },
    {
      "sentence": "The random sentence generator generated a random sentence about a random sentence."
    },
    {
      "sentence": "The fact that there's a stairway to heaven and a highway to hell explains life well."
    },
    {
      "sentence": "He stepped gingerly onto the bridge knowing that enchantment awaited on the other side."
    },
    {
      "sentence": "He learned the hardest lesson of his life and had the scars, both physical and mental, to prove it."
    },
    {
      "sentence": "He wondered why at 18 he was old enough to go to war, but not old enough to buy cigarettes."
    },
    {
      "sentence": "She saw no irony asking me to change but wanting me to accept her for who she is."
    },
    {
      "sentence": "I just wanted to tell you I could see the love you have for your child by the way you look at her."
    },
    {
      "sentence": "As he waited for the shower to warm, he noticed that he could hear water change temperature."
    },
    {
      "sentence": "The efficiency we have at removing trash has made creating trash more acceptable."
    },
    {
      "sentence": "The opportunity of a lifetime passed before him as he tried to decide between a cone or a cup."
    },
    {
      "sentence": "One small action would change her life, but whether it would be for better or for worse was yet to be determined."
    },
    {
      "sentence": "He was 100% into fasting with her until he understood that meant he couldn't eat."
    },
    {
      "sentence": "It would have been a better night if the guys next to us weren't in the splash zone."
    },
    {
      "sentence": "You've been eyeing me all day and waiting for your move like a lion stalking a gazelle in a savannah."
    },
    {
      "sentence": "As you consider all the possible ways to improve yourself and the world, you notice John Travolta seems fairly unhappy."
    },
    {
      "sentence": "You realize you're not alone as you sit in your bedroom massaging your calves after a long day of playing tug-of-war with Grandpa Joe in the hospital."
    },
    {
      "sentence": "You're unsure whether or not to trust him, but very thankful that you wore a turtle neck."
    },
    {
      "sentence": "Your girlfriend bought your favorite cookie crisp cereal but forgot to get milk."
    },
    {
      "sentence": "If my calculator had a history, it would be more embarrassing than my browser history."
    },
    {
      "sentence": "He was so preoccupied with whether or not he could that he failed to stop to consider if he should."
    },
    {
      "sentence": "It's much more difficult to play tennis with a bowling ball than it is to bowl with a tennis ball."
    },
    {
      "sentence": "When nobody is around, the trees gossip about the people who have walked under them."
    },
    {
      "sentence": "It was at that moment that he learned there are certain parts of the body that you should never Nair."
    },
    {
      "sentence": "He realized there had been several deaths on this road, but his concern rose when he saw the exact number."
    },
    {
      "sentence": "He set out for a short walk, but now all he could see were mangroves and water were for miles."
    },
    {
      "sentence": "The Tsunami wave crashed against the raised houses and broke the pilings as if they were toothpicks."
    },
    {
      "sentence": "Lightning Paradise was the local hangout joint where the group usually ended up spending the night."
    },
    {
      "sentence": "As the rental car rolled to a stop on the dark road, her fear increased by the moment."
    },
    {
      "sentence": "The newly planted trees were held up by wooden frames in hopes they could survive the next storm."
    },
    {
      "sentence": "The gruff old man sat in the back of the bait shop grumbling to himself as he scooped out a handful of worms."
    },
    {
      "sentence": "The urgent care center was flooded with patients after the news of a new deadly virus was made public."
    },
    {
      "sentence": "It was always dangerous to drive with him since he insisted the safety cones were a slalom course."
    },
    {
      "sentence": "The wake behind the boat told of the past while the open sea for told life in the unknown future."
    },
    {
      "sentence": "Even though he thought the world was flat he didn’t see the irony of wanting to travel around the world."
    },
    {
      "sentence": "Thigh-high in the water, the fisherman’s hope for dinner soon turned to despair."
    },
    {
      "sentence": "Buried deep in the snow, he hoped his batteries were fresh in his avalanche beacon."
    },
    {
      "sentence": "As he entered the church he could hear the soft voice of someone whispering into a cell phone."
    },
    {
      "sentence": "The blinking lights of the antenna tower came into focus just as I heard a loud snap."
    },
    {
      "sentence": "Car safety systems have come a long way, but he was out to prove they could be outsmarted."
    },
    {
      "sentence": "He was the type of guy who liked Christmas lights on his house in the middle of July."
    },
    {
      "sentence": "Twin 4-month-olds slept in the shade of the palm tree while the mother tanned in the sun."
    },
    {
      "sentence": "She wasn't sure whether to be impressed or concerned that he folded underwear in neat little packages."
    },
    {
      "sentence": "When she didn’t like a guy who was trying to pick her up, she started using sign language."
    },
    {
      "sentence": "Swim at your own risk was taken as a challenge for the group of Kansas City college students."
    },
    {
      "sentence": "When he had to picnic on the beach, he purposely put sand in other people’s food."
    },
    {
      "sentence": "He walked into the basement with the horror movie from the night before playing in his head."
    },
    {
      "sentence": "No matter how beautiful the sunset, it saddened her knowing she was one day older."
    },
    {
      "sentence": "She lived on Monkey Jungle Road and that seemed to explain all of her strangeness."
    },
    {
      "sentence": "When motorists sped in and out of traffic, all she could think of was those in need of a transplant."
    },
    {
      "sentence": "It dawned on her that others could make her happier, but only she could make herself happy."
    },
    {
      "sentence": "She tilted her head back and let whip cream stream into her mouth while taking a bath."
    },
    {
      "sentence": "He used to get confused between soldiers and shoulders, but as a military man, he now soldiers responsibility."
    },
    {
      "sentence": "He was disappointed when he found the beach to be so sandy and the sun so sunny."
    },
    {
      "sentence": "She is never happy until she finds something to be unhappy about; then, she is overjoyed."
    },
    {
      "sentence": "The busker hoped that the people passing by would throw money, but they threw tomatoes instead, so he exchanged his hat for a juicer."
    },
    {
      "sentence": "You're good at English when you know the difference between a man eating chicken and a man-eating chicken."
    },
    {
      "sentence": "Before he moved to the inner city, he had always believed that security complexes were psychological."
    },
    {
      "sentence": "Wisdom is easily acquired when hiding under the bed with a saucepan on your head."
    },
    {
      "sentence": "If eating three-egg omelets causes weight-gain, budgie eggs are a good substitute."
    },
    {
      "sentence": "You have every right to be angry, but that doesn't give you the right to be mean."
    },
    {
      "sentence": "He wore the surgical mask in public not to keep from catching a virus, but to keep people away from him."
    },
    {
      "sentence": "He figured a few sticks of dynamite were easier than a fishing pole to catch fish."
    },
    {
      "sentence": "We have young kids who often walk into our room at night for various reasons including clowns in the closet."
    },
    {
      "sentence": "8% of 25 is the same as 25% of 8 and one of them is much easier to do in your head."
    },
    {
      "sentence": "Most shark attacks occur about 10 feet from the beach since that's where the people are."
    },
    {
      "sentence": "David subscribes to the \"stuff your tent into the bag\" strategy over nicely folding it."
    },
    {
      "sentence": "I'm a great listener, really good with empathy vs sympathy and all that, but I hate people."
    },
    {
      "sentence": "When I cook spaghetti, I like to boil it a few minutes past al dente so the noodles are super slippery."
    },
    {
      "sentence": "She was sad to hear that fireflies are facing extinction due to artificial light, habitat loss, and pesticides."
    },
    {
      "sentence": "He decided that the time had come to be stronger than any of the excuses he'd used until then."
    },
    {
      "sentence": "His ultimate dream fantasy consisted of being content and sleeping eight hours in a row."
    },
    {
      "sentence": "There aren't enough towels in the world to stop the sewage flowing from his mouth."
    },
    {
      "sentence": "His thought process was on so many levels that he gave himself a phobia of heights."
    },
    {
      "sentence": "The clouds formed beautiful animals in the sky that eventually created a tornado to wreak havoc."
    },
    {
      "sentence": "The fish dreamed of escaping the fishbowl and into the toilet where he saw his friend go."
    },
    {
      "sentence": "Although it wasn't a pot of gold, Nancy was still enthralled at what she found at the end of the rainbow."
    },
    {
      "sentence": "Thirty years later, she still thought it was okay to put the toilet paper roll under rather than over."
    },
    {
      "sentence": "It took him a while to realize that everything he decided not to change, he was actually choosing."
    },
    {
      "sentence": "It was difficult for Mary to admit that most of her workout consisted of exercising poor judgment."
    },
    {
      "sentence": "The two walked down the slot canyon oblivious to the sound of thunder in the distance."
    },
    {
      "sentence": "Gary didn't understand why Doug went upstairs to get one dollar bills when he invited him to go cow tipping."
    },
    {
      "sentence": "As the asteroid hurtled toward earth, Becky was upset her dentist appointment had been canceled."
    },
    {
      "sentence": "She looked at the masterpiece hanging in the museum but all she could think is that her five-year-old could do better."
    },
    {
      "sentence": "He knew it was going to be a bad day when he saw mountain lions roaming the streets."
    },
    {
      "sentence": "She was too busy always talking about what she wanted to do to actually do any of it."
    },
    {
      "sentence": "She had that tint of craziness in her soul that made her believe she could actually make a difference."
    },
    {
      "sentence": "She moved forward only because she trusted that the ending she now was going through must be followed by a new beginning."
    },
    {
      "sentence": "While all her friends were positive that Mary had a sixth sense, she knew she actually had a seventh sense."
    },
    {
      "sentence": "The group quickly understood that toxic waste was the most effective barrier to use against the zombies."
    },
    {
      "sentence": "There have been days when I wished to be separated from my body, but today wasn’t one of those days."
    },
    {
      "sentence": "To the surprise of everyone, the Rapture happened yesterday but it didn't quite go as expected."
    },
    {
      "sentence": "The bullet pierced the window shattering it before missing Danny's head by mere millimeters."
    },
    {
      "sentence": "The complicated school homework left the parents trying to help their kids quite confused."
    },
    {
      "sentence": "The tattered work gloves speak of the many hours of hard labor he endured throughout his life."
    },
    {
      "sentence": "The hummingbird's wings blurred while it eagerly sipped the sugar water from the feeder."
    },
    {
      "sentence": "Watching the geriatric men’s softball team brought back memories of 3 yr olds playing t-ball."
    },
    {
      "sentence": "The teens wondered what was kept in the red shed on the far edge of the school grounds."
    },
    {
      "sentence": "The sunblock was handed to the girl before practice, but the burned skin was proof she did not apply it."
    },
    {
      "sentence": "As time wore on, simple dog commands turned into full paragraphs explaining why the dog couldn’t do something."
    },
    {
      "sentence": "The team members were hard to tell apart since they all wore their hair in a ponytail."
    },
    {
      "sentence": "She learned that water bottles are no longer just to hold liquid, but they're also status symbols."
    },
    {
      "sentence": "Giving directions that the mountains are to the west only works when you can see them."
    },
    {
      "sentence": "It's not possible to convince a monkey to give you a banana by promising it infinite bananas when they die."
    },
    {
      "sentence": "Martha came to the conclusion that shake weights are a great gift for any occasion."
    },
    {
      "sentence": "She had convinced her kids that any mushroom found on the ground would kill them if they touched it."
    },
    {
      "sentence": "As she walked along the street and looked in the gutter, she realized facemasks had become the new cigarette butts."
    },
    {
      "sentence": "Mary realized if her calculator had a history, it would be more embarrassing than her computer browser history."
    },
    {
      "sentence": "I thought red would have felt warmer in summer but I didn't think about the equator."
    },
    {
      "sentence": "Honestly, I didn't care much for the first season, so I didn't bother with the second."
    },
    {
      "sentence": "They desperately needed another drummer since the current one only knew how to play bongos."
    },
    {
      "sentence": "Hang on, my kittens are scratching at the bathtub and they'll upset by the lack of biscuits."
    },
    {
      "sentence": "When he asked her favorite number, she answered without hesitation that it was diamonds."
    },
    {
      "sentence": "She couldn't understand why nobody else could see that the sky is full of cotton candy."
    },
    {
      "sentence": "He felt that dining on the bridge brought romance to his relationship with his cat."
    },
    {
      "sentence": "You should never take advice from someone who thinks red paint dries quicker than blue paint."
    },
    {
      "sentence": "Strawberries must be the one food that doesn't go well with this brand of paint."
    },
    {
      "sentence": "We're careful about orange ping pong balls because people might think they're fruit."
    },
    {
      "sentence": "The worst thing about being at the top of the career ladder is that there's a long way to fall."
    },
    {
      "sentence": "It took me too long to realize that the ceiling hadn't been painted to look like the sky."
    },
    {
      "sentence": "Douglas figured the best way to succeed was to do the opposite of what he'd been doing all his life."
    },
    {
      "sentence": "Being unacquainted with the chief raccoon was harming his prospects for promotion."
    },
    {
      "sentence": "The sight of his goatee made me want to run and hide under my sister-in-law's bed."
    },
    {
      "sentence": "The most exciting eureka moment I've had was when I realized that the instructions on food packets were just guidelines."
    },
    {
      "sentence": "It must be easy to commit crimes as a snake because you don't have to worry about leaving fingerprints."
    },
    {
      "sentence": "I've traveled all around Africa and still haven't found the gnu who stole my scarf."
    },
    {
      "sentence": "The changing of down comforters to cotton bedspreads always meant the squirrels had returned."
    },
    {
      "sentence": "Barking dogs and screaming toddlers have the unique ability to turn friendly neighbors into cranky enemies."
    },
    {
      "sentence": "The furnace repairman indicated the heating system was acting as an air conditioner."
    },
    {
      "sentence": "The stench from the feedlot permeated the car despite having the air conditioning on recycled air."
    },
    {
      "sentence": "Acres of almond trees lined the interstate highway which complimented the crazy driving nuts."
    },
    {
      "sentence": "Nancy thought the best way to create a welcoming home was to line it with barbed wire."
    },
    {
      "sentence": "The dead trees waited to be ignited by the smallest spark and seek their revenge."
    },
    {
      "sentence": "She found it strange that people use their cellphones to actually talk to one another."
    },
    {
      "sentence": "Normal activities took extraordinary amounts of concentration at the high altitude."
    },
    {
      "sentence": "The fence was confused about whether it was supposed to keep things in or keep things out."
    },
    {
      "sentence": "The hawk didn’t understand why the ground squirrels didn’t want to be his friend."
    },
    {
      "sentence": "The family’s excitement over going to Disneyland was crazier than she anticipated."
    },
    {
      "sentence": "Jason didn’t understand why his parents wouldn’t let him sell his little sister at the garage sale."
    },
    {
      "sentence": "The father handed each child a roadmap at the beginning of the 2-day road trip and explained it was so they could find their way home."
    },
    {
      "sentence": "The elderly neighborhood became enraged over the coyotes who had been blamed for the poodle’s disappearance."
    },
    {
      "sentence": "The child’s favorite Christmas gift was the large box her father’s lawnmower came in."
    },
    {
      "sentence": "I used to practice weaving with spaghetti three hours a day but stopped because I didn't want to die alone."
    },
    {
      "sentence": "I had a friend in high school named Rick Shaw, but he was fairly useless as a mode of transport."
    },
    {
      "sentence": "The anaconda was the greatest criminal mastermind in this part of the neighborhood."
    },
    {
      "sentence": "They say people remember important moments in their life well, yet no one even remembers their own birth."
    },
    {
      "sentence": "I always dreamed about being stranded on a desert island until it actually happened."
    },
    {
      "sentence": "If you really strain your ears, you can just about hear the sound of no one giving a damn."
    },
    {
      "sentence": "It's never comforting to know that your fate depends on something as unpredictable as the popping of corn."
    },
    {
      "sentence": "Despite what your teacher may have told you, there is a wrong way to wield a lasso."
    },
    {
      "sentence": "I made myself a peanut butter sandwich as I didn't want to subsist on veggie crackers."
    },
    {
      "sentence": "I know many children ask for a pony, but I wanted a bicycle with rockets strapped to it."
    },
    {
      "sentence": "For some unfathomable reason, the response team didn't consider a lack of milk for my cereal as a proper emergency."
    },
    {
      "sentence": "The efficiency with which he paired the socks in the drawer was quite admirable."
    },
    {
      "sentence": "You have no right to call yourself creative until you look at a trowel and think that it would make a great lockpick."
    },
    {
      "sentence": "I can't believe this is the eighth time I'm smashing open my piggy bank on the same day!"
    },
    {
      "sentence": "I'm worried by the fact that my daughter looks to the local carpet seller as a role model."
    },
    {
      "sentence": "My secretary is the only person who truly understands my stamp-collecting obsession."
    }
  ]
}
